Revit 2027 API
StairsLanding.SetSketchedLandingBoundaryAndPath Method
 Sets the boundary and path curves of the sketched landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSketchedLandingBoundaryAndPath(
	Document document,
	CurveLoop boundaryCurveLoop,
	CurveLoop pathCurveLoop
)
Public Sub SetSketchedLandingBoundaryAndPath (
	document As Document,
	boundaryCurveLoop As CurveLoop,
	pathCurveLoop As CurveLoop
)
public:
void SetSketchedLandingBoundaryAndPath(
	Document^ document,
	CurveLoop^ boundaryCurveLoop,
	CurveLoop^ pathCurveLoop
)
member SetSketchedLandingBoundaryAndPath :
        document : Document *
        boundaryCurveLoop : CurveLoop *
        pathCurveLoop : CurveLoop -> unit
Parameters
document Document
 The document that owns the landing.
boundaryCurveLoop CurveLoop
 The closed boundary curves of the landing.
pathCurveLoop CurveLoop
 The path curves of the landing, can be an empty CurveLoop.
Exceptions
Exception | Condition
ArgumentException |  The boundaryCurveLoop is not closed. -or- The input boundaryCurveLoop contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- The input pathCurveLoop contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- Failed to create curve element by the boundaryCurveLoop or pathCurveLoop.
ArgumentNullException |  A non-optional argument was null
Remarks
 This should be run from within an open transaction.
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace